import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:sabr/text_styles/title_colors.dart';
import 'package:sabr/widgets/app_drawer.dart';

class ShamPage extends StatelessWidget {
  const ShamPage({super.key});

  @override
  Widget build(BuildContext context) {
    final List<TextItem> texts = [
      TextItem(
        'Шам намазынын парзы окулуп, салам берилгенден кийин:',
        TextStyles.largeTitle,
      ),
      TextItem(
        '«(Астагфируллах, 3 жолу) \n Аллохума антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икром»',
        TextStyles.blackTitle,
        TextAlign.center,
      ),
      TextItem(
        'деп айтылат. Анан колдор көтөрүлүп, алакандар жайылып «Солаатан тунжина» дубасы окулат:',
        TextStyles.redTitle,
      ),
      TextItem(
        '«Аллоохумма солли ‘алаа саййидинаа Мухаммадин ва ‘алаа аали саййидинаа Мухаммад, солаатан тунжиина бихаа мин жамии’ил ахваали вал аафат. ("аафаат" деп айтып жатканда алакан төмөн, бүткөндө өйдө каратылат.) Ва тагдий ланаа бихаа жамии’ал хаажат, ва тутоххирунаа бихаа мин жамии’ис саййи’аат, ва тарфа’унаа бихаа ‘индака а’лад даражаат, ва тубаллиггунаа бихаа аксал гааяат, мин жамии’ил хайраати фил хаяати ва ба’дал мамаат, инахаллааху ‘алаа заалика, вал хамду лиллаахи Робб ‘ааламийн»',
        TextStyles.blackTitle,
      ),
      TextItem('деп алакандар бетке сүрүлөт.', TextStyles.redTitle),
      TextItem(
        "Шам намаздын сүннөтү окулуп, Салам берилгенден кийин:",
        TextStyles.redTitle,
      ),
      TextItem(
        "Фа’лам аннаху (1 жолу)",
        TextStyles.blackTitle,
        TextAlign.center,
      ),
      TextItem(
        "«Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мульку ва лахул хамду юхйий ва йумиит, ва хува хаййун лаа ямуут, биадийхил хайр, ва хува ‘алаа кулли шай-ин кодиир, ва илайхил масиир»   (10 жолу окулуп, 10-нун аягында)",
        TextStyles.blackTitle,
      ),
      TextItem("ва илайхил масыйр (кошулат).", TextStyles.blackTitle),
      TextItem(
        "Истиаза дубалары окулат (колдор көтөрүлүп, алакан төмөн каратылат):",
        TextStyles.redTitle,
      ),
      TextItem(
        "«Аллоохумма ажирнаа минан-наар» (3, 5 же 7 жолу окулат) \n~Аллоохумма ажирнаа мин кулли наар.\n~Аллоохумма ажирнаа мин фитнатид-дииниййати вад-дунйавиййа.\n~Аллоохумма ажирнаа мин фитнати аахириз замаан.\n~Аллоохумма ажирнаа мин фитнатил масийхид-даж-жаали вас-суфйаан.\n~Аллоохумма ажирнаа мин минад-долаалаати вал бид'ий-йаати вал балиййаат.\n~Аллоохумма ажирнаа мин шаррин нафсил аммааро.\n~Аллоохумма ажирнаа мин шуруурин нуфуусил аммаароотил фиравниййа.\n~Аллоохумма ажирнаа мин шаррин нисаа.\n~Аллоохумма ажирнаа мин балла-ин нисаа.\n~Аллоохумма ажирнаа мин фитнатин нисаа.\n~Аллоохумма ажирнаа мин 'азаабил кобр.\n~Аллоохумма ажирнаа мин 'азааби яумил кыйаама.\n~Аллоохумма ажирнаа мин 'азааби жаханнам.\n~Аллоохумма ажирнаа мин 'азааби кохрик.\n~Аллоохумма ажирнаа мин наари кохрик.\n~Аллоохумма ажирнаа мин азаабил кобри ван нийроон.\n~Аллоохумма ажирнаа мин минар рийаа-и вас сум'ати вал 'ужуби вал фахр.\n~Аллоохумма ажирнаа мин тажаавузил мулхидиин.\n~Аллоохумма ажирнаа мин шаррил мунаафикиин \n~Аллоохумма ажирнаа мин фитнатил фаасикиин.\n~Аллоохумма ажирнаа ва ажир ваалидайнаа ва толабата Росаа-илин нуурис-соодикийна фий хидматил кур-аани вал-иймаан, ва ахбаабанал му-миниинал мухлисыйна ва акрибаа-анаа ва аждааданаа минан наар.",
        TextStyles.blackTitle,
      ),
      TextItem("(ушул жерде алакандар жогору каратылат)", TextStyles.redTitle),
      TextItem(
        "«Би 'афвика йаа Мужиир, бифадлика йаа Гоффаар.\n Аллоохумма адхилнал жанната ма'ал аброор». (Бул 3 жолу айтылат)",
        TextStyles.blackTitle,
      ),
      TextItem(
        "«Аллоохумма адхилнаа ва адхил (устаазанда ва ваалидайнаа ва толабата росаа-илин нуурис соодикийна) ва ихваананаа ва аховаатанаа ва акрибаа-анаа ва аждааданаа ва ахбаабанал му-миниинал мухлисыйна фий хидматил иймаани вал кур-аан, ал жанната ма'ал аброор, би шафаа'ати набиййикал мухтаар ва аалихиил атхаар ва асхаабихил ахйаар васаллим маа даамал лайлу ван нахаар. Аамиин, вал хамду лиллаахи Роббил 'ааламиин».",
        TextStyles.blackTitle,
      ),
      TextItem("(Алакандар бетке сүрүлөт.)", TextStyles.redTitle),
      TextItem(
        "*Анан намаздын аягындагы тасбихтерге өтөбуз:",
        TextStyles.redTitle,
      ),
      TextItem(
        "«Субхааналлоохи вал хамду лиллаахи ва лаа илааха иллаллооху валлооху акбар, ва лаа хавла ва лаа куввата иллаа биллаахил 'алиййил 'азыйм ",
        TextStyles.blackTitle,
      ),
      TextItem('деп айтылат жана «Аятал Курси» окулат.', TextStyles.redTitle),
      TextItem('Бисмиллаахир Рахмаанир Рахиим.', TextStyles.largeTitle),
      TextItem(
        "«Аллооху лаа илааха иллаа хувал хаййул каййуум, лаа та-хузухуу синатун валаа наум, лаху маа фиссамааваати вамаа фил ард, ман заллазий йашфа'у 'индахуу иллаа би-изних, йа'ламу маа байна айдийхим вамаа холфахум валаа йухийтууна би шай-ин мин 'илмихии иллаа бимаа шаа-а, васи'а курсиййухус самааваати вал арди, валаа йа-уудухуу хифзухумаа ва хувал 'алиййул 'азыйм».'",
        TextStyles.blackTitle,
      ),
      TextItem(
        'Намаз тасбихтери айтылат:',
        TextStyles.redTitle,
        TextAlign.center,
      ),
      TextItem(
        'Субхааналлоох (33 жолу)\nАльхамду лиллах (33 жолу)\nАллооху акбар (33 жолу)',
        TextStyles.blackTitle,
        TextAlign.center,
      ),
      TextItem(
        '«Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мульку ва лахул хамду юхйий ва йумиит, ва хува хаййун лаа ямуут, биадийхил хайр, ва хува ‘алаа кулли шай-ин кодиир, ва илайхил масиир»',
        TextStyles.blackTitle,
      ),
      TextItem('(деп айтылып дуа кылынат)', TextStyles.redTitle),
      TextItem('Дубадан кийинки тасбихат улантылат:', TextStyles.redTitle),
      TextItem(
        'Фа’лам аннаху (1 жолу)',
        TextStyles.blackTitle,
        TextAlign.center,
      ),
      TextItem('Лаа илааха иллаллоох', TextStyles.blackTitle, TextAlign.center),
      TextItem('(33 жолу окулат)', TextStyles.redTitle, TextAlign.center),
      TextItem(
        '«Мухаммадун Расуулуллоохи соллаллооху та’аалаа ‘алайхи ва саллам»',
        TextStyles.blackTitle,
      ),
      TextItem('Андан соң:', TextStyles.redTitle, TextAlign.center),
      TextItem(
        'Тасбихаттан кийин салават-саламдар окулат:',
        TextStyles.redTitle,
      ),
      TextItem('Бисмиллаахир Рохмаанир Рахиим.', TextStyles.largeTitle),
      TextItem(
        "~ Инналлооха ва малаа-икатаху йусоллууна 'алан набий, йаа айюхаллазийна аамануус соллу'алайхи васаллимуу таслиймаа, лаббайк!.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Аллоохумма солли 'алаа саййидиина Мухаммадин ва 'алаа аали саййидиина Мухаммад, би 'адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва 'алайхим касиироо.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Аллоохумма солли 'алаа саййидиина Мухаммадин ва 'алаа аали саййидиина Мухаммад, би ‘адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касиироо.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Аллоохумма солли 'алаа саййидиина Мухаммадин ва 'алаа аали саййидиина Мухаммад, би ‘адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касийрон касийроо.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Солли васаллим йаа Робби ‘алаа хабийбика Мухаммадин ва 'алаа жамии’ил анбийаа-и вал мурсалийн, ва 'алаа аали куллин ва сохби куллин ажма’иин. Аамиин, вал хамду лиллаахи Роббил 'ааламиин.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Алфу алфи солаатин ва алфу алфи салаамин ‘алайка йаа расуулллоох.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Алфу алфи солаатин ва алфу алфи салаамин ‘алайка йаа хабиибуллоох.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "~ Алфу алфи солаатин ва алфу алфи салаамин ‘алайка йаа амина вахийллаах.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "Аллоохумма соли васаллим ва баарик,‘алаа саййидинаа Мухаммадин ва ‘алаа аалихи ва асхаабих, би ‘адади авроокил ашжаари ва амваажил бихааари ва катороотил амтоор, вагфир ланаа вархамнаа валтуф бинаа (ва би устаазина ва ваалидийнаа ва битолаабати росаа-илин нурис-соодикиин), йаа илаахаанаа би кулли солаатин минхаа, ашхаду ан лаа илааха иллаллоох, ва ашхаду анна Мухаммадам Расуулуллоох соллаллооху та‘аала ‘алайхи ва саллам.",
        TextStyles.blackTitle,
      ),
      TextItem(
        "Бисмиллаахир Рахмаанир Рахиим.",
        TextStyles.largeTitle,
      ), //-------------------
      TextItem(
        "~ Йаа Жамиилу йаа Аллаах Йаа Кориибу йаа Аллаах \n~Йаа Мужиибу йаа Аллаах Йаа Хабиибу йаа Аллаах \n~Йаа Ро-ууфу йаа Аллаах Йаа 'Атууфу йаа Аллаах \n~Йаа Ма'рууфу йаа Аллаах Йаа Латыйфу йаа Аллаах \n~Йаа 'Азыйму йаа Аллаах Йаа Ханнаану йаа Аллаах \n~Йаа Маннаану йаа Аллаах Йаа Даййаану йаа Аллаах \n~Йаа Субхаану йаа Аллаах Йаа Амаану йаа Аллаах \n~Йаа Бурхаану йаа Аллаах Йаа Султоону йаа Аллаах \n~Йаа Муста'аану йаа Аллаах Йаа Мухсину йаа Аллаах \n~Йаа Мута'аалу йаа Аллаах Йаа Рохмаану йаа Аллаах \n~Йаа Рохийму йаа Аллаах Йаа Карийму йаа Аллаах \n~Йаа Мажииду йаа Аллаах Йаа Фарду йаа Аллаах \n~Йаа Витру йаа Аллаах Йаа Ахаду йаа Аллаах \n~Йаа Сомаду йаа Аллаах Йаа Махмууду йаа Аллаах \n~Йаа Соодикал Ва'ди йаа Аллаах Йаа 'Алиййу йаа Аллаах \n~Йаа Гониййу йаа Аллаах Йаа Шаафий йаа Аллаах\n~Йаа Каафий йаа Аллаах Йаа Му'аафий йаа Аллаах\n~Йаа Баакий йаа Аллаах Йаа Хаадий йаа Аллаах \n~Йаа Коодиру йаа Аллаах Йаа Саатиру йаа Аллаах \n~Йаа Коххаару йаа Аллаах Йаа Жаббаару йаа Аллаах \n~Йаа Гоффаару йаа Аллаах Йаа Фаттааху йаа Аллаах",
        TextStyles.blackTitle,
      ),
      TextItem(
        "Алакандар жогору каратылып, колдор көтөрүлөт:",
        TextStyles.redTitle,
      ),
      TextItem(
        "«Йаа Роббас самааваати вал арди, йаа зал жалаали вал икроом, (н)ас-алука би хакки хаазихил асмаа-и куллихаа ан тусоллийа 'алаа саййидинаа Мухаммадин ва 'алаа аали Мухаммад, вархам Мухаммадан камаа соллайта ва салламта ва баарокта ва рохимта ва тароххамта 'алаа Ибрахийма ва 'алаа аали Ибрахийма фил 'ааламиин, Роббанаа иннака Хамийдун Мажиид, би рохматика йаа архамар роохимиин, вал хамду лиллаахи Роббил 'ааламиин».",
        TextStyles.blackTitle,
      ),
      TextItem("«Хашр» сүрөсүнүн 20-24 аяттары окулат:", TextStyles.redTitle),
      TextItem("Бисмиллаахир Рахмаанир Рахиим.", TextStyles.largeTitle),
      TextItem(
        "«Лаа яставии асхаабун наари ва асхаабул жанна, асхаабул жаннати хумул фаа-изуун. Лау анзалнаа хаазал кур-аана 'алаа жабалин ларо-айтаху хооши'ан мутасоди'ан мин хошйатиллаах ва тилкал-амсаалу надрибухаа линнааси ла'аллахум ятафаккаруун. Хуваллоохуллазий лаа илааха иллаа хуу, 'Аалимул гойби вашшахаадати хувар Рохмаанур Рахиим. Хуваллоохуллазий лаа илааха иллаа хуу, ал Маликул Куддуусус Салаамул Му-минул Мухайминул Азийзул Жаббаарул Мутакаббир, Субхааналлоохи аммаа йушрикуун. Хуваллоохул Хооликул Баари'ул Мусоввиру лахул асмаа-ул хуснаа, йусаббиху лахуу маа фис самааваати вал-ард, ва хувал Азийзул Хакиим».",
        TextStyles.blackTitle,
      ),
      TextItem("СодакАллоохул 'Азыйм.", TextStyles.redTitle, TextAlign.center),
    ];

    return Scaffold(
      backgroundColor: const Color(0xffF2EFE7),
      appBar: AppBar(
        backgroundColor: const Color(0xff16423C),
        title: Text(
          "Шам",
          style: GoogleFonts.nunito(
            fontWeight: FontWeight.bold,
            color: Colors.white,
          ),
        ),
        iconTheme: const IconThemeData(color: Colors.white),
      ),
      drawer: AppDrawer(),
      body: Padding(
        padding: const EdgeInsets.symmetric(horizontal: 20, vertical: 20),
        child: ListView.separated(
          itemCount: texts.length,
          separatorBuilder:
              (context, index) => const SizedBox(height: 15), // Авто-отступ
          itemBuilder:
              (context, index) => Text(
                texts[index].text,
                style: texts[index].style,
                textAlign:
                    texts[index].textAlign ??
                    TextAlign.start, // Добавлено textAlign
                softWrap: true,
              ),
        ),
      ),
    );
  }
}

// Модель для текстов
class TextItem {
  final String text;
  final TextStyle style;
  final TextAlign? textAlign;
  TextItem(this.text, this.style, [this.textAlign]);
}
